name: "Siamese_ImageNet"
layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "label"
  image_data_param {
    source: "image_importance_example/data/guru_ranking_reallabel_training.txt"
    batch_size: 50
    new_height: 256
    new_width: 256
  }
  transform_param {
    crop_size: 227
    mean_file: "data/ilsvrc12/imagenet_mean.binaryproto"
    mirror: true
  }
  include: { phase: TRAIN }
}
layer {
  name: "event_label"
  type: "HDF5Data"
  top: "event_label"
  hdf5_data_param {
    source: "image_importance_example/data/guru_training_event_label.txt"
    batch_size: 50
  }
  include: { phase: TRAIN }
}

layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "label"
  image_data_param {
    source: "image_importance_example/data/guru_ranking_reallabel_val.txt"
    batch_size: 50
    new_height: 256
    new_width: 256
  }
  transform_param {
    crop_size: 227
    mean_file: "data/ilsvrc12/imagenet_mean.binaryproto"
    mirror: false
  }
  include: { phase: TEST }
}
layer {
  name: "event_label"
  type: "HDF5Data"
  top: "event_label"
  hdf5_data_param {
    source: "image_importance_example/data/guru_val_event_label.txt"
    batch_size: 50
  }
  include: { phase: TEST }
}


layer {
  name: "data_p"
  type: "ImageData"
  top: "data_p"
  top: "label_p"
  image_data_param {
    source: "image_importance_example/data/guru_ranking_reallabel_training_p.txt"
    batch_size: 50
    new_height: 256
    new_width: 256
  }
  transform_param {
    crop_size: 227
    mean_file: "data/ilsvrc12/imagenet_mean.binaryproto"
    mirror: true
  }
  include: { phase: TRAIN }
}
layer {
  name: "data_p"
  type: "ImageData"
  top: "data_p"
  top: "label_p"
  image_data_param {
    source: "image_importance_example/data/guru_ranking_reallabel_val_p.txt"
    batch_size: 50
    new_height: 256
    new_width: 256
  }
  transform_param {
    mean_file: "data/ilsvrc12/imagenet_mean.binaryproto"
    crop_size: 227
    mirror: false
  }
  include: { phase: TEST }
}


layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    name: "conv1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "conv1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "norm1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param {
    name: "conv2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}


layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "norm2"
  type: "LRN"
  bottom: "conv2"
  top: "norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "norm2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  param {
    name: "conv3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    name: "conv4_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv4_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
    name: "conv5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "conv5"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6"
  param {
    name: "fc6_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc6_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  param {
    name: "fc7_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc7_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc8_multevent"
  type: "InnerProduct"
  bottom: "fc7"
  top: "fc8_multevent"
  param {
    name: "fc8_w"
    lr_mult: 10
    decay_mult: 1
  }
  param {
    name: "fc8_b"
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 23
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "sigmoid"
  type: "Sigmoid"
  bottom: "fc8_multevent"
  top: "sigmoid9"
}



layer {
  name: "conv1_p"
  type: "Convolution"
  bottom: "data_p"
  top: "conv1_p"
  param {
    name: "conv1_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv1_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "relu1_p"
  type: "ReLU"
  bottom: "conv1_p"
  top: "conv1_p"
}
layer {
  name: "norm1_p"
  type: "LRN"
  bottom: "conv1_p"
  top: "norm1_p"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "pool1_p"
  type: "Pooling"
  bottom: "norm1_p"
  top: "pool1_p"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}

layer {
  name: "conv2_p"
  type: "Convolution"
  bottom: "pool1_p"
  top: "conv2_p"
  param {
    name: "conv2_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv2_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}


layer {
  name: "relu2_p"
  type: "ReLU"
  bottom: "conv2_p"
  top: "conv2_p"
}
layer {
  name: "norm2_p"
  type: "LRN"
  bottom: "conv2_p"
  top: "norm2_p"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "pool2_p"
  type: "Pooling"
  bottom: "norm2_p"
  top: "pool2_p"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3_p"
  type: "Convolution"
  bottom: "pool2_p"
  top: "conv3_p"
  param {
    name: "conv3_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv3_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_p"
  type: "ReLU"
  bottom: "conv3_p"
  top: "conv3_p"
}
layer {
  name: "conv4_p"
  type: "Convolution"
  bottom: "conv3_p"
  top: "conv4_p"
  param {
    name: "conv4_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv4_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "relu4_p"
  type: "ReLU"
  bottom: "conv4_p"
  top: "conv4_p"
}
layer {
  name: "conv5_p"
  type: "Convolution"
  bottom: "conv4_p"
  top: "conv5_p"
  param {
    name: "conv5_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "conv5_b"
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "relu5_p"
  type: "ReLU"
  bottom: "conv5_p"
  top: "conv5_p"
}
layer {
  name: "pool5_p"
  type: "Pooling"
  bottom: "conv5_p"
  top: "pool5_p"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fc6_p"
  type: "InnerProduct"
  bottom: "pool5_p"
  top: "fc6_p"
  param {
    name: "fc6_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc6_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "relu6_p"
  type: "ReLU"
  bottom: "fc6_p"
  top: "fc6_p"
}
layer {
  name: "drop6_p"
  type: "Dropout"
  bottom: "fc6_p"
  top: "fc6_p"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7_p"
  type: "InnerProduct"
  bottom: "fc6_p"
  top: "fc7_p"
  param {
    name: "fc7_w"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "fc7_b"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}
layer {
  name: "relu7_p"
  type: "ReLU"
  bottom: "fc7_p"
  top: "fc7_p"
}
layer {
  name: "drop7_p"
  type: "Dropout"
  bottom: "fc7_p"
  top: "fc7_p"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc8_multevent_p"
  type: "InnerProduct"
  bottom: "fc7_p"
  top: "fc8_multevent_p"
  param {
    name: "fc8_w"
    lr_mult: 10
    decay_mult: 1
  }
  param {
    name: "fc8_b"
    lr_mult: 20
    decay_mult: 0
  }
  inner_product_param {
    num_output: 23
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "sigmoid_p"
  type: "Sigmoid"
  bottom: "fc8_multevent_p"
  top: "sigmoid9_p"
}

layer {
  name: "slicer_label"
  type: "Slice"
  bottom: "event_label"
  top: "event_label1"
  top: "event_label2"
  top: "event_label3"
  top: "event_label4"
  top: "event_label5"
  top: "event_label6"
  top: "event_label7"
  top: "event_label8"
  top: "event_label9"
  top: "event_label10"
  top: "event_label11"
  top: "event_label12"
  top: "event_label13"
  top: "event_label14"
  top: "event_label15"
  top: "event_label16"
  top: "event_label17"
  top: "event_label18"
  top: "event_label19"
  top: "event_label20"
  top: "event_label21"
  top: "event_label22"
  top: "event_label23"
  slice_param {
    axis: 1
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4 
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
    slice_point: 20  
    slice_point: 21
    slice_point: 22
  }
}

layer {
  name: "slicer_sigmoid"
  type: "Slice"
  bottom: "sigmoid9"
  top: "sigmoid9_1"
  top: "sigmoid9_2"
  top: "sigmoid9_3"
  top: "sigmoid9_4"
  top: "sigmoid9_5"
  top: "sigmoid9_6"
  top: "sigmoid9_7"
  top: "sigmoid9_8"
  top: "sigmoid9_9"
  top: "sigmoid9_10"
  top: "sigmoid9_11"
  top: "sigmoid9_12"
  top: "sigmoid9_13"
  top: "sigmoid9_14"
  top: "sigmoid9_15"
  top: "sigmoid9_16"
  top: "sigmoid9_17"
  top: "sigmoid9_18"
  top: "sigmoid9_19"
  top: "sigmoid9_20"
  top: "sigmoid9_21"
  top: "sigmoid9_22"
  top: "sigmoid9_23"
  slice_param {
    axis: 1
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4 
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
    slice_point: 20  
    slice_point: 21
    slice_point: 22
  }
}

layer {
  name: "slicer_sigmoid_p"
  type: "Slice"
  bottom: "sigmoid9_p"
  top: "sigmoid9_1p"
  top: "sigmoid9_2p"
  top: "sigmoid9_3p"
  top: "sigmoid9_4p"
  top: "sigmoid9_5p"
  top: "sigmoid9_6p"
  top: "sigmoid9_7p"
  top: "sigmoid9_8p"
  top: "sigmoid9_9p"
  top: "sigmoid9_10p"
  top: "sigmoid9_11p"
  top: "sigmoid9_12p"
  top: "sigmoid9_13p"
  top: "sigmoid9_14p"
  top: "sigmoid9_15p"
  top: "sigmoid9_16p"
  top: "sigmoid9_17p"
  top: "sigmoid9_18p"
  top: "sigmoid9_19p"
  top: "sigmoid9_20p"
  top: "sigmoid9_21p"
  top: "sigmoid9_22p"
  top: "sigmoid9_23p"
  slice_param {
    axis: 1
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4 
    slice_point: 5
    slice_point: 6
    slice_point: 7
    slice_point: 8
    slice_point: 9
    slice_point: 10
    slice_point: 11
    slice_point: 12
    slice_point: 13
    slice_point: 14
    slice_point: 15
    slice_point: 16
    slice_point: 17
    slice_point: 18
    slice_point: 19
    slice_point: 20  
    slice_point: 21
    slice_point: 22
  }
}

layer {
  name: "label_scaled"
  type: "Power"
  bottom: "label"
  top: "label_scaled"
  power_param {
    power: 1
    scale: 0.0125
    shift: 0.5
  }
}

layer {
  name: "label_scaled_p"
  type: "Power"
  bottom: "label_p"
  top: "label_scaled_p"
  power_param {
    power: 1
    scale: 0.0125
    shift: 0.5
  }
}

layer {
    name: "loss1"
    type: "PRankingLoss"
    piecewise_ranking_loss_param {
	margin1: 0.1
        margin2: 0.3
	norml2: true	
    }
    bottom: "sigmoid9_1"
    bottom: "sigmoid9_1p"
    bottom: "label_scaled"
    bottom: "label_scaled_p"
    bottom: "event_label1"
    top: "loss1"
}
layer {
    name: "loss2"
    type: "PRankingLoss"
    piecewise_ranking_loss_param {
	margin1: 0.1
        margin2: 0.3
	norml2: true	
    }
    bottom: "sigmoid9_2"
    bottom: "sigmoid9_2p"
    bottom: "label_scaled"
    bottom: "label_scaled_p"
    bottom: "event_label2"
    top: "loss2"
}
layer {
    name: "loss3"
    type: "PRankingLoss"
    piecewise_ranking_loss_param {
	margin1: 0.1
        margin2: 0.3
	norml2: true	
    }
    bottom: "sigmoid9_3"
    bottom: "sigmoid9_3p"
    bottom: "label_scaled"
    bottom: "label_scaled_p"
    bottom: "event_label3"
    top: "loss3"
}
layer {
    name: "loss4"
    type: "PRankingLoss"
    piecewise_ranking_loss_param {
	margin1: 0.1
        margin2: 0.3
	norml2: true	
    }
    bottom: "sigmoid9_4"
    bottom: "sigmoid9_4p"
    bottom: "label_scaled"
    bottom: "label_scaled_p"
    bottom: "event_label4"
    top: "loss4"
}
layer {
    name: "loss5"
    type: "PRankingLoss"
    piecewise_ranking_loss_param {
	margin1: 0.1
        margin2: 0.3
	norml2: true	
    }
    bottom: "sigmoid9_5"
    bottom: "sigmoid9_5p"
    bottom: "label_scaled"
    bottom: "label_scaled_p"
    bottom: "event_label5"
    top: "loss5"
}
layer {
    name: "loss6"
    type: "PRankingLoss"
    piecewise_ranking_loss_param {
	margin1: 0.1
        margin2: 0.3
	norml2: true	
    }
    bottom: "sigmoid9_6"
    bottom: "sigmoid9_6p"
    bottom: "label_scaled"
    bottom: "label_scaled_p"
    bottom: "event_label6"
    top: "loss6"
}
layer {
    name: "loss7"
    type: "PRankingLoss"
    piecewise_ranking_loss_param {
	margin1: 0.1
        margin2: 0.3
	norml2: true	
    }
    bottom: "sigmoid9_7"
    bottom: "sigmoid9_7p"
    bottom: "label_scaled"
    bottom: "label_scaled_p"
    bottom: "event_label7"
    top: "loss7"
}
layer {
    name: "loss8"
    type: "PRankingLoss"
    piecewise_ranking_loss_param {
	margin1: 0.1
        margin2: 0.3
	norml2: true	
    }
    bottom: "sigmoid9_8"
    bottom: "sigmoid9_8p"
    bottom: "label_scaled"
    bottom: "label_scaled_p"
    bottom: "event_label8"
    top: "loss8"
}
layer {
    name: "loss9"
    type: "PRankingLoss"
    piecewise_ranking_loss_param {
	margin1: 0.1
        margin2: 0.3
	norml2: true	
    }
    bottom: "sigmoid9_9"
    bottom: "sigmoid9_9p"
    bottom: "label_scaled"
    bottom: "label_scaled_p"
    bottom: "event_label9"
    top: "loss9"
}
layer {
    name: "loss10"
    type: "PRankingLoss"
    piecewise_ranking_loss_param {
	margin1: 0.1
        margin2: 0.3
	norml2: true	
    }
    bottom: "sigmoid9_10"
    bottom: "sigmoid9_10p"
    bottom: "label_scaled"
    bottom: "label_scaled_p"
    bottom: "event_label10"
    top: "loss10"
}
layer {
    name: "loss11"
    type: "PRankingLoss"
    piecewise_ranking_loss_param {
	margin1: 0.1
        margin2: 0.3
	norml2: true	
    }
    bottom: "sigmoid9_11"
    bottom: "sigmoid9_11p"
    bottom: "label_scaled"
    bottom: "label_scaled_p"
    bottom: "event_label11"
    top: "loss11"
}
layer {
    name: "loss12"
    type: "PRankingLoss"
    piecewise_ranking_loss_param {
	margin1: 0.1
        margin2: 0.3
	norml2: true	
    }
    bottom: "sigmoid9_12"
    bottom: "sigmoid9_12p"
    bottom: "label_scaled"
    bottom: "label_scaled_p"
    bottom: "event_label12"
    top: "loss12"
}
layer {
    name: "loss13"
    type: "PRankingLoss"
    piecewise_ranking_loss_param {
	margin1: 0.1
        margin2: 0.3
	norml2: true	
    }
    bottom: "sigmoid9_13"
    bottom: "sigmoid9_13p"
    bottom: "label_scaled"
    bottom: "label_scaled_p"
    bottom: "event_label13"
    top: "loss13"
}
layer {
    name: "loss14"
    type: "PRankingLoss"
    piecewise_ranking_loss_param {
	margin1: 0.1
        margin2: 0.3
	norml2: true	
    }
    bottom: "sigmoid9_14"
    bottom: "sigmoid9_14p"
    bottom: "label_scaled"
    bottom: "label_scaled_p"
    bottom: "event_label14"
    top: "loss14"
}
layer {
    name: "loss15"
    type: "PRankingLoss"
    piecewise_ranking_loss_param {
	margin1: 0.1
        margin2: 0.3
	norml2: true	
    }
    bottom: "sigmoid9_15"
    bottom: "sigmoid9_15p"
    bottom: "label_scaled"
    bottom: "label_scaled_p"
    bottom: "event_label15"
    top: "loss15"
}
layer {
    name: "loss16"
    type: "PRankingLoss"
    piecewise_ranking_loss_param {
	margin1: 0.1
        margin2: 0.3
	norml2: true	
    }
    bottom: "sigmoid9_16"
    bottom: "sigmoid9_16p"
    bottom: "label_scaled"
    bottom: "label_scaled_p"
    bottom: "event_label16"
    top: "loss16"
}
layer {
    name: "loss17"
    type: "PRankingLoss"
    piecewise_ranking_loss_param {
	margin1: 0.1
        margin2: 0.3
	norml2: true	
    }
    bottom: "sigmoid9_17"
    bottom: "sigmoid9_17p"
    bottom: "label_scaled"
    bottom: "label_scaled_p"
    bottom: "event_label17"
    top: "loss17"
}
layer {
    name: "loss18"
    type: "PRankingLoss"
    piecewise_ranking_loss_param {
	margin1: 0.1
        margin2: 0.3
	norml2: true	
    }
    bottom: "sigmoid9_18"
    bottom: "sigmoid9_18p"
    bottom: "label_scaled"
    bottom: "label_scaled_p"
    bottom: "event_label18"
    top: "loss18"
}
layer {
    name: "loss19"
    type: "PRankingLoss"
    piecewise_ranking_loss_param {
	margin1: 0.1
        margin2: 0.3
	norml2: true	
    }
    bottom: "sigmoid9_19"
    bottom: "sigmoid9_19p"
    bottom: "label_scaled"
    bottom: "label_scaled_p"
    bottom: "event_label19"
    top: "loss19"
}
layer {
    name: "loss20"
    type: "PRankingLoss"
    piecewise_ranking_loss_param {
	margin1: 0.1
        margin2: 0.3
	norml2: true	
    }
    bottom: "sigmoid9_20"
    bottom: "sigmoid9_20p"
    bottom: "label_scaled"
    bottom: "label_scaled_p"
    bottom: "event_label20"
    top: "loss20"
}
layer {
    name: "loss21"
    type: "PRankingLoss"
    piecewise_ranking_loss_param {
	margin1: 0.1
        margin2: 0.3
	norml2: true	
    }
    bottom: "sigmoid9_21"
    bottom: "sigmoid9_21p"
    bottom: "label_scaled"
    bottom: "label_scaled_p"
    bottom: "event_label21"
    top: "loss21"
}
layer {
    name: "loss22"
    type: "PRankingLoss"
    piecewise_ranking_loss_param {
	margin1: 0.1
        margin2: 0.3
	norml2: true	
    }
    bottom: "sigmoid9_22"
    bottom: "sigmoid9_22p"
    bottom: "label_scaled"
    bottom: "label_scaled_p"
    bottom: "event_label22"
    top: "loss22"
}
layer {
    name: "loss23"
    type: "PRankingLoss"
    piecewise_ranking_loss_param {
	margin1: 0.1
        margin2: 0.3
	norml2: true	
    }
    bottom: "sigmoid9_23"
    bottom: "sigmoid9_23p"
    bottom: "label_scaled"
    bottom: "label_scaled_p"
    bottom: "event_label23"
    top: "loss23"
}
